'use strict';

const searchMockData = [{
  "id": `RSAcLK`,
  "title": `Как достигнуть успеха не вставая с кресла`,
  "announce": `Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать. Как начать действовать? Для начала просто соберитесь. Ёлки — это не просто красивое дерево. Это прочная древесина. Он написал больше 30 хитов.`,
  "fullText": `Он написал больше 30 хитов. Достичь успеха помогут ежедневные повторения. Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем. Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравятся только игры. Первая большая ёлка была установлена только в 1938 году. Из под его пера вышло 8 платиновых альбомов. Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много. Собрать камни бесконечности легко, если вы прирожденный герой.`,
  "createdDate": `2021-03-13 05:58:36`,
  "category": [`Кино`],
  "comments": [{
    "id": `l0wMy8`,
    "text": `Планируете записать видосик на эту тему? Давно не пользуюсь стационарными компьютерами. Ноутбуки победили. Это где ж такие красоты? Плюсую, но слишком много буквы! Совсем немного... Согласен с автором! Мне не нравится ваш стиль. Ощущение, что вы меня поучаете.`
  }, {
    "id": `hWulk7`,
    "text": `Планируете записать видосик на эту тему? Давно не пользуюсь стационарными компьютерами. Ноутбуки победили. Хочу такую же футболку :-) Это где ж такие красоты? Согласен с автором! Мне кажется или я уже читал это где-то? Плюсую, но слишком много буквы!`
  }]
}, {
  "id": `fShzyU`,
  "title": `Учим HTML и CSS`,
  "announce": `Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много. Программировать не настолько сложно, как об этом говорят. Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать. Простые ежедневные упражнения помогут достичь успеха.`,
  "fullText": `Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать.`,
  "createdDate": `2021-04-26 12:31:59`,
  "category": [`Кино`, `Музыка`, `Разное`, `За жизнь`, `Железо`],
  "comments": [{
    "id": `SurfYJ`,
    "text": `Совсем немного... Хочу такую же футболку :-) Плюсую, но слишком много буквы! Это где ж такие красоты? Мне не нравится ваш стиль. Ощущение, что вы меня поучаете. Согласен с автором!`
  }, {
    "id": `bCJYx2`,
    "text": `Планируете записать видосик на эту тему? Плюсую, но слишком много буквы! Это где ж такие красоты? Давно не пользуюсь стационарными компьютерами. Ноутбуки победили. Совсем немного... Мне не нравится ваш стиль. Ощущение, что вы меня поучаете.`
  }, {
    "id": `Yp0k1P`,
    "text": `Хочу такую же футболку :-) Это где ж такие красоты? Плюсую, но слишком много буквы! Планируете записать видосик на эту тему? Совсем немного... Давно не пользуюсь стационарными компьютерами. Ноутбуки победили.`
  }, {
    "id": `NCyL1u`,
    "text": `Мне кажется или я уже читал это где-то? Совсем немного... Согласен с автором! Плюсую, но слишком много буквы! Это где ж такие красоты? Планируете записать видосик на эту тему? Мне не нравится ваш стиль. Ощущение, что вы меня поучаете.`
  }]
}, {
  "id": `3lqU0W`,
  "title": `Борьба с прокрастинацией`,
  "announce": `Достичь успеха помогут ежедневные повторения. Как начать действовать? Для начала просто соберитесь. Программировать не настолько сложно, как об этом говорят. Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравятся только игры.`,
  "fullText": `Как начать действовать? Для начала просто соберитесь. Простые ежедневные упражнения помогут достичь успеха. Ёлки — это не просто красивое дерево. Это прочная древесина. Он написал больше 30 хитов. Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много. Вы можете достичь всего. Стоит только немного постараться и запастись книгами. Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами. Программировать не настолько сложно, как об этом говорят. Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете. Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравятся только игры.`,
  "createdDate": `2021-03-01 06:13:34`,
  "category": [`Музыка`, `Разное`, `Программирование`, `Без рамки`, `Железо`, `Кино`, `IT`, `Деревья`, `За жизнь`],
  "comments": [{
    "id": `HjbxF2`,
    "text": `Плюсую, но слишком много буквы! Давно не пользуюсь стационарными компьютерами. Ноутбуки победили. Хочу такую же футболку :-) Совсем немного... Мне не нравится ваш стиль. Ощущение, что вы меня поучаете. Согласен с автором! Планируете записать видосик на эту тему? Это где ж такие красоты?`
  }, {
    "id": `efsENE`,
    "text": `Согласен с автором! Плюсую, но слишком много буквы! Хочу такую же футболку :-) Мне не нравится ваш стиль. Ощущение, что вы меня поучаете. Это где ж такие красоты? Совсем немного...`
  }]
}, {
  "id": `6UIwGT`,
  "title": `Как собрать камни бесконечности`,
  "announce": `Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике. Золотое сечение — соотношение двух величин, гармоническая пропорция. Достичь успеха помогут ежедневные повторения. Как начать действовать? Для начала просто соберитесь.`,
  "fullText": `Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравятся только игры. Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете. Простые ежедневные упражнения помогут достичь успеха. Из под его пера вышло 8 платиновых альбомов. Вы можете достичь всего. Стоит только немного постараться и запастись книгами. Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами. Как начать действовать? Для начала просто соберитесь.`,
  "createdDate": `2021-04-24 07:51:07`,
  "category": [`Кино`, `IT`, `Музыка`, `Без рамки`, `Деревья`, `Программирование`],
  "comments": [{
    "id": `J1gR88`,
    "text": `Совсем немного... Хочу такую же футболку :-) Согласен с автором! Планируете записать видосик на эту тему? Это где ж такие красоты? Давно не пользуюсь стационарными компьютерами. Ноутбуки победили. Мне не нравится ваш стиль. Ощущение, что вы меня поучаете.`
  }, {
    "id": `DJ6C13`,
    "text": `Это где ж такие красоты? Давно не пользуюсь стационарными компьютерами. Ноутбуки победили. Мне кажется или я уже читал это где-то? Согласен с автором! Плюсую, но слишком много буквы! Планируете записать видосик на эту тему? Совсем немного...`
  }, {
    "id": `jKduKQ`,
    "text": `Мне не нравится ваш стиль. Ощущение, что вы меня поучаете. Согласен с автором! Совсем немного... Это где ж такие красоты? Давно не пользуюсь стационарными компьютерами. Ноутбуки победили. Мне кажется или я уже читал это где-то?`
  }, {
    "id": `PSDHzj`,
    "text": `Мне не нравится ваш стиль. Ощущение, что вы меня поучаете. Согласен с автором! Мне кажется или я уже читал это где-то? Плюсую, но слишком много буквы! Совсем немного... Это где ж такие красоты?`
  }]
}, {
  "id": `nQMDCk`,
  "title": `Ёлки. История деревьев`,
  "announce": `Собрать камни бесконечности легко, если вы прирожденный герой. Он написал больше 30 хитов. Первая большая ёлка была установлена только в 1938 году. Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем.`,
  "fullText": `Достичь успеха помогут ежедневные повторения. Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравятся только игры.`,
  "createdDate": `2021-05-02 13:35:02`,
  "category": [`Разное`, `Железо`, `Музыка`, `IT`, `Кино`, `За жизнь`],
  "comments": [{
    "id": `zaUW-Z`,
    "text": `Согласен с автором! Мне кажется или я уже читал это где-то? Плюсую, но слишком много буквы! Это где ж такие красоты? Планируете записать видосик на эту тему? Совсем немного...`
  }]
}];

const categoryMockData = [{
  "id": `eRgM9w`,
  "title": `Лучшие рок-музыканты 20-века`,
  "announce": `Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать. Простые ежедневные упражнения помогут достичь успеха. Он написал больше 30 хитов. Рок-музыка всегда ассоциировалась с протестами. Так ли это на самом деле?`,
  "fullText": `Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике. Простые ежедневные упражнения помогут достичь успеха. Собрать камни бесконечности легко, если вы прирожденный герой. Ёлки — это не просто красивое дерево. Это прочная древесина. Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать. Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много. Первая большая ёлка была установлена только в 1938 году.`,
  "createdDate": `2021-05-21 11:10:14`,
  "category": [`Программирование`, `Без рамки`],
  "comments": [{
    "id": `2iSwpN`,
    "text": `Плюсую, но слишком много буквы! Хочу такую же футболку :-) Согласен с автором! Мне кажется или я уже читал это где-то? Совсем немного... Мне не нравится ваш стиль. Ощущение, что вы меня поучаете.`
  }, {
    "id": `vuWvKh`,
    "text": `Давно не пользуюсь стационарными компьютерами. Ноутбуки победили. Это где ж такие красоты? Плюсую, но слишком много буквы! Хочу такую же футболку :-) Мне не нравится ваш стиль. Ощущение, что вы меня поучаете. Согласен с автором! Планируете записать видосик на эту тему? Совсем немного...`
  }]
}, {
  "id": `WDTMQ-`,
  "title": `Учим HTML и CSS`,
  "announce": `Программировать не настолько сложно, как об этом говорят. Это один из лучших рок-музыкантов. Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много. Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравятся только игры.`,
  "fullText": `Программировать не настолько сложно, как об этом говорят. Достичь успеха помогут ежедневные повторения. Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами. Первая большая ёлка была установлена только в 1938 году. Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много. Из под его пера вышло 8 платиновых альбомов. Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете. Как начать действовать? Для начала просто соберитесь. Простые ежедневные упражнения помогут достичь успеха. Он написал больше 30 хитов.`,
  "createdDate": `2021-02-27 02:53:55`,
  "category": [`Кино`, `Программирование`, `IT`, `Деревья`, `Музыка`, `Железо`],
  "comments": [{
    "id": `hLROnR`,
    "text": `Мне не нравится ваш стиль. Ощущение, что вы меня поучаете. Давно не пользуюсь стационарными компьютерами. Ноутбуки победили. Плюсую, но слишком много буквы! Хочу такую же футболку :-) Совсем немного... Планируете записать видосик на эту тему? Мне кажется или я уже читал это где-то?`
  }, {
    "id": `F5tjUn`,
    "text": `Это где ж такие красоты? Планируете записать видосик на эту тему? Мне не нравится ваш стиль. Ощущение, что вы меня поучаете. Плюсую, но слишком много буквы! Совсем немного... Хочу такую же футболку :-)`
  }]
}, {
  "id": `UqqfVS`,
  "title": `Что такое золотое сечение`,
  "announce": `Золотое сечение — соотношение двух величин, гармоническая пропорция. Это один из лучших рок-музыкантов. Он написал больше 30 хитов. Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много.`,
  "fullText": `Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать. Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете. Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике. Из под его пера вышло 8 платиновых альбомов.`,
  "createdDate": `2021-05-06 21:23:07`,
  "category": [`Кино`, `Музыка`, `Программирование`, `Железо`, `За жизнь`, `Деревья`],
  "comments": [{
    "id": `e-Wwlj`,
    "text": `Планируете записать видосик на эту тему? Совсем немного... Плюсую, но слишком много буквы! Мне кажется или я уже читал это где-то? Давно не пользуюсь стационарными компьютерами. Ноутбуки победили. Согласен с автором! Это где ж такие красоты?`
  }, {
    "id": `uD0ps5`,
    "text": `Согласен с автором! Это где ж такие красоты? Совсем немного... Мне кажется или я уже читал это где-то? Мне не нравится ваш стиль. Ощущение, что вы меня поучаете. Хочу такую же футболку :-)`
  }, {
    "id": `5Cv4ch`,
    "text": `Хочу такую же футболку :-) Мне кажется или я уже читал это где-то? Плюсую, но слишком много буквы! Согласен с автором! Планируете записать видосик на эту тему? Это где ж такие красоты?`
  }, {
    "id": `LxXuRZ`,
    "text": `Планируете записать видосик на эту тему? Совсем немного... Плюсую, но слишком много буквы! Согласен с автором! Мне не нравится ваш стиль. Ощущение, что вы меня поучаете. Давно не пользуюсь стационарными компьютерами. Ноутбуки победили.`
  }]
}, {
  "id": `3aK8mx`,
  "title": `Ёлки. История деревьев`,
  "announce": `Это один из лучших рок-музыкантов. Простые ежедневные упражнения помогут достичь успеха. Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравятся только игры. Вы можете достичь всего. Стоит только немного постараться и запастись книгами.`,
  "fullText": `Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем. Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много. Рок-музыка всегда ассоциировалась с протестами. Так ли это на самом деле? Он написал больше 30 хитов. Собрать камни бесконечности легко, если вы прирожденный герой. Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравятся только игры. Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете.`,
  "createdDate": `2021-03-20 18:33:52`,
  "category": [`Железо`, `Программирование`, `За жизнь`, `IT`, `Кино`, `Без рамки`, `Деревья`, `Разное`, `Музыка`],
  "comments": [{
    "id": `PNDg9e`,
    "text": `Это где ж такие красоты? Согласен с автором! Плюсую, но слишком много буквы! Хочу такую же футболку :-) Совсем немного... Планируете записать видосик на эту тему? Мне кажется или я уже читал это где-то?`
  }, {
    "id": `zSscAN`,
    "text": `Мне не нравится ваш стиль. Ощущение, что вы меня поучаете. Планируете записать видосик на эту тему? Давно не пользуюсь стационарными компьютерами. Ноутбуки победили. Согласен с автором! Хочу такую же футболку :-) Это где ж такие красоты? Мне кажется или я уже читал это где-то? Плюсую, но слишком много буквы!`
  }, {
    "id": `WMKQT5`,
    "text": `Это где ж такие красоты? Хочу такую же футболку :-) Плюсую, но слишком много буквы! Планируете записать видосик на эту тему? Совсем немного... Мне кажется или я уже читал это где-то?`
  }]
}, {
  "id": `bp6GCX`,
  "title": `Как перестать беспокоиться и начать жить`,
  "announce": `Простые ежедневные упражнения помогут достичь успеха. Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем. Вы можете достичь всего. Стоит только немного постараться и запастись книгами. Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике.`,
  "fullText": `Программировать не настолько сложно, как об этом говорят. Достичь успеха помогут ежедневные повторения. Ёлки — это не просто красивое дерево. Это прочная древесина. Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать. Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике. Золотое сечение — соотношение двух величин, гармоническая пропорция. Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами.`,
  "createdDate": `2021-03-21 02:39:19`,
  "category": [`Музыка`, `Деревья`, `За жизнь`, `Без рамки`],
  "comments": [{
    "id": `OqtI1K`,
    "text": `Планируете записать видосик на эту тему? Хочу такую же футболку :-) Это где ж такие красоты? Согласен с автором! Давно не пользуюсь стационарными компьютерами. Ноутбуки победили. Мне не нравится ваш стиль. Ощущение, что вы меня поучаете. Плюсую, но слишком много буквы!`
  }, {
    "id": `GXsYtA`,
    "text": `Хочу такую же футболку :-) Мне кажется или я уже читал это где-то? Планируете записать видосик на эту тему? Совсем немного... Давно не пользуюсь стационарными компьютерами. Ноутбуки победили. Это где ж такие красоты?`
  }, {
    "id": `MuwCh_`,
    "text": `Планируете записать видосик на эту тему? Мне не нравится ваш стиль. Ощущение, что вы меня поучаете. Согласен с автором! Совсем немного... Мне кажется или я уже читал это где-то? Давно не пользуюсь стационарными компьютерами. Ноутбуки победили. Это где ж такие красоты? Плюсую, но слишком много буквы!`
  }, {
    "id": `FrHugK`,
    "text": `Совсем немного... Плюсую, но слишком много буквы! Хочу такую же футболку :-) Это где ж такие красоты? Согласен с автором! Мне не нравится ваш стиль. Ощущение, что вы меня поучаете.`
  }]
}];

const mockCategories = [`Программирование`, `Кино`, `Железо`, `Музыка`];

const articleMockData = [{
  "id": `KSYUdB`,
  "title": `Лучшие рок-музыканты 20-века`,
  "announce": `Вы можете достичь всего. Стоит только немного постараться и запастись книгами. Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете. Достичь успеха помогут ежедневные повторения. Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем.`,
  "fullText": `Он написал больше 30 хитов.`,
  "createdDate": `2021-05-03 19:07:05`,
  "category": [`Железо`, `IT`, `Музыка`, `Кино`, `Программирование`, `Деревья`, `За жизнь`, `Без рамки`],
  "comments": [{
    "id": `dE0raH`,
    "text": `Согласен с автором! Плюсую, но слишком много буквы! Это где ж такие красоты? Мне не нравится ваш стиль. Ощущение, что вы меня поучаете. Планируете записать видосик на эту тему? Давно не пользуюсь стационарными компьютерами. Ноутбуки победили.`
  }, {
    "id": `FRgn5K`,
    "text": `Согласен с автором! Хочу такую же футболку :-) Планируете записать видосик на эту тему? Совсем немного... Давно не пользуюсь стационарными компьютерами. Ноутбуки победили. Это где ж такие красоты?`
  }, {
    "id": `01NMT9`,
    "text": `Мне не нравится ваш стиль. Ощущение, что вы меня поучаете. Совсем немного... Согласен с автором! Мне кажется или я уже читал это где-то? Это где ж такие красоты? Давно не пользуюсь стационарными компьютерами. Ноутбуки победили.`
  }, {
    "id": `2srf3x`,
    "text": `Плюсую, но слишком много буквы! Давно не пользуюсь стационарными компьютерами. Ноутбуки победили. Мне кажется или я уже читал это где-то? Согласен с автором! Планируете записать видосик на эту тему? Это где ж такие красоты?`
  }]
}, {
  "id": `NipxpM`,
  "title": `Как достигнуть успеха не вставая с кресла`,
  "announce": `Простые ежедневные упражнения помогут достичь успеха. Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике. Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами. Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать.`,
  "fullText": `Рок-музыка всегда ассоциировалась с протестами. Так ли это на самом деле? Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать. Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике.`,
  "createdDate": `2021-05-14 05:21:15`,
  "category": [`Железо`],
  "comments": [{
    "id": `IWQmmx`,
    "text": `Совсем немного... Мне не нравится ваш стиль. Ощущение, что вы меня поучаете. Планируете записать видосик на эту тему? Плюсую, но слишком много буквы! Давно не пользуюсь стационарными компьютерами. Ноутбуки победили. Согласен с автором! Это где ж такие красоты?`
  }, {
    "id": `9XBTWe`,
    "text": `Давно не пользуюсь стационарными компьютерами. Ноутбуки победили. Планируете записать видосик на эту тему? Это где ж такие красоты? Мне кажется или я уже читал это где-то? Хочу такую же футболку :-) Согласен с автором! Мне не нравится ваш стиль. Ощущение, что вы меня поучаете. Плюсую, но слишком много буквы!`
  }, {
    "id": `l6BfAa`,
    "text": `Мне кажется или я уже читал это где-то? Давно не пользуюсь стационарными компьютерами. Ноутбуки победили. Согласен с автором! Плюсую, но слишком много буквы! Это где ж такие красоты? Планируете записать видосик на эту тему? Совсем немного... Мне не нравится ваш стиль. Ощущение, что вы меня поучаете.`
  }]
}, {
  "id": `JCGo4o`,
  "title": `Как собрать камни бесконечности`,
  "announce": `Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравятся только игры. Из под его пера вышло 8 платиновых альбомов. Первая большая ёлка была установлена только в 1938 году. Вы можете достичь всего. Стоит только немного постараться и запастись книгами.`,
  "fullText": `Золотое сечение — соотношение двух величин, гармоническая пропорция. Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете. Программировать не настолько сложно, как об этом говорят. Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем.`,
  "createdDate": `2021-03-20 23:29:56`,
  "category": [`Кино`, `Программирование`],
  "comments": [{
    "id": `ngNbjB`,
    "text": `Давно не пользуюсь стационарными компьютерами. Ноутбуки победили. Согласен с автором! Мне кажется или я уже читал это где-то? Это где ж такие красоты? Совсем немного... Мне не нравится ваш стиль. Ощущение, что вы меня поучаете. Хочу такую же футболку :-)`
  }, {
    "id": `SzEtpL`,
    "text": `Мне не нравится ваш стиль. Ощущение, что вы меня поучаете. Плюсую, но слишком много буквы! Согласен с автором! Это где ж такие красоты? Мне кажется или я уже читал это где-то? Давно не пользуюсь стационарными компьютерами. Ноутбуки победили. Планируете записать видосик на эту тему? Совсем немного...`
  }]
}, {
  "id": `A_VumA`,
  "title": `Лучшие рок-музыканты 20-века`,
  "announce": `Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике. Ёлки — это не просто красивое дерево. Это прочная древесина. Программировать не настолько сложно, как об этом говорят. Собрать камни бесконечности легко, если вы прирожденный герой.`,
  "fullText": `Из под его пера вышло 8 платиновых альбомов. Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать. Рок-музыка всегда ассоциировалась с протестами. Так ли это на самом деле? Это один из лучших рок-музыкантов. Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравятся только игры. Вы можете достичь всего. Стоит только немного постараться и запастись книгами. Достичь успеха помогут ежедневные повторения. Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете. Простые ежедневные упражнения помогут достичь успеха.`,
  "createdDate": `2021-04-16 08:56:23`,
  "category": [`Без рамки`, `Музыка`, `За жизнь`],
  "comments": [{
    "id": `0dKMv3`,
    "text": `Мне не нравится ваш стиль. Ощущение, что вы меня поучаете. Планируете записать видосик на эту тему? Это где ж такие красоты? Плюсую, но слишком много буквы! Мне кажется или я уже читал это где-то? Совсем немного... Согласен с автором!`
  }]
}, {
  "id": `dJsGXi`,
  "title": `Как достигнуть успеха не вставая с кресла`,
  "announce": `Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами. Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике. Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много. Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете.`,
  "fullText": `Собрать камни бесконечности легко, если вы прирожденный герой. Золотое сечение — соотношение двух величин, гармоническая пропорция. Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете.`,
  "createdDate": `2021-03-08 06:56:09`,
  "category": [`IT`, `Без рамки`],
  "comments": [{
    "id": `XLrme1`,
    "text": `Хочу такую же футболку :-) Давно не пользуюсь стационарными компьютерами. Ноутбуки победили. Согласен с автором! Планируете записать видосик на эту тему? Плюсую, но слишком много буквы! Это где ж такие красоты? Мне не нравится ваш стиль. Ощущение, что вы меня поучаете.`
  }, {
    "id": `C5ZbnX`,
    "text": `Плюсую, но слишком много буквы! Планируете записать видосик на эту тему? Совсем немного... Мне кажется или я уже читал это где-то? Согласен с автором! Мне не нравится ваш стиль. Ощущение, что вы меня поучаете. Это где ж такие красоты? Хочу такую же футболку :-)`
  }]
}];

module.exports = {
  searchMockData,
  categoryMockData,
  articleMockData,
  mockCategories,
};
